uat_chat/Documents/уатПеремещениеТСиОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>уатПеремещениеТСиОборудования</Name>
			<Comment>Перемещение ТС и оборудования (уат)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.уатОстаткиГСМнаТС</xr:Item>
				<xr:Item>InformationRegister.уатМестонахождениеТС</xr:Item>
				<xr:Item>InformationRegister.уатСостояниеТС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Колонна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКолонны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетСогласования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСостояниеТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрПроверено</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>333</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Comment>Транспортное средство</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВвода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

uat_chat/InformationRegisters/уатМестонахождениеТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>уатМестонахождениеТС</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Колонна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКолонны</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСостояниеТС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

uat_chat/AccumulationRegisters/уатОстаткиГСМнаТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>уатОстаткиГСМнаТС</Name>
			<Comment>(уат)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьУпр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цех</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатОбъектыСтроительства</v8:Type>
						<v8:Type>cfg:CatalogRef.ЦехаКонтрагента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АЗС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатАЗС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Comment>Водитель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПЛ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатПутевойЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Слив</Name>
					<Comment>1 - на ТС; 2 - на склад</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОборудованиеРаботыГСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоНорма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПластиковаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПластиковыеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГСМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатАЗС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БакОсновной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокПартии</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатЗаправкаГСМ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

uat_chat/Documents/уатПеремещениеТСиОборудования/Ext/ManagerModule.bsl
// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	СформироватьТаблицуТС(ДокументСсылка, СтруктураДополнительныеСвойства);
	СформироватьТаблицаСостояниеТС(ДокументСсылка, СтруктураДополнительныеСвойства);
	//////СформироватьТаблицуГСМ(ДокументСсылка, СтруктураДополнительныеСвойства);
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Формирует таблицу значений, содержащую данные для проведения по регистру Местонахождение ТС.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуТС(ДокументСсылка, СтруктураДополнительныеСвойства)
	тблМестонахожденияТС = Новый ТаблицаЗначений;
	тблМестонахожденияТС.Колонки.Добавить("Регистратор");
	тблМестонахожденияТС.Колонки.Добавить("Период");
	тблМестонахожденияТС.Колонки.Добавить("ТС");
	тблМестонахожденияТС.Колонки.Добавить("Организация");
	тблМестонахожденияТС.Колонки.Добавить("Подразделение");
	тблМестонахожденияТС.Колонки.Добавить("Колонна");
	тблМестонахожденияТС.Колонки.Добавить("Состояние");
	тблМестонахожденияТС.Колонки.Добавить("Владелец");
	
	Для Каждого ТекСтрокаТС Из ДокументСсылка.ТС Цикл
		НоваяСтрока = тблМестонахожденияТС.Добавить();
		НоваяСтрока.Период = ТекСтрокаТС.ДатаВвода;
		НоваяСтрока.Регистратор = ДокументСсылка;
		НоваяСтрока.ТС = ТекСтрокаТС.ТС;
		НоваяСтрока.Организация = ДокументСсылка.Организация;
		НоваяСтрока.Подразделение = ДокументСсылка.Подразделение;
		НоваяСтрока.Колонна = ДокументСсылка.Колонна;
		
		Если ЗначениеЗаполнено(ДокументСсылка.Состояние) ТОгда
			НоваяСтрока.Состояние = ДокументСсылка.Состояние;
		ИНАче
			МестоТС = уатОбщегоНазначения.МестонахождениеТС(ТекСтрокаТС.ТС, НачалоДня(ТекСтрокаТС.ДатаВвода)-1);
			НоваяСтрока.Состояние = МестоТС.Состояние;
		КонецЕСЛИ;
		
		Если ДокументСсылка.Состояние = Справочники.уатСостояниеТС.Привлеченный Тогда
			Если ЗначениеЗаполнено(ДокументСсылка.Владелец) ТОгда
				НоваяСтрока.Владелец = ДокументСсылка.Владелец;
			ИНАче
				МестоТС = уатОбщегоНазначения.МестонахождениеТС(ТекСтрокаТС.ТС, НачалоДня(ТекСтрокаТС.ДатаВвода)-1);
				Если МестоТС.Владелец <> ДокументСсылка.Организация ТОгда
					НоваяСтрока.Владелец = МестоТС.Владелец;
				КонецЕСЛИ;
			КонецеСЛИ;
		ИНаче
			НоваяСтрока.Владелец = ДокументСсылка.Организация;
		КонецеСЛИ;
	КонецЦикла;
	
	//управляемая блокировка
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.уатМестонахождениеТС");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = тблМестонахожденияТС;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ТС", "ТС");
	Блокировка.Заблокировать();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаМестонахожденияТС", тблМестонахожденияТС);
КонецПроцедуры // СформироватьТаблицуАгрегатыТС()

// Формирует таблицу значений, содержащую данные для проведения по регистру Остатки ГСМ на ТС.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуГСМ(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	//запрос по ТС, которые учитываются при перемещении ГСМ
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	уатПеремещениеТСиОборудованияТС.ТС КАК ТС
	|ИЗ
	|	Документ.уатПеремещениеТСиОборудования.ТС КАК уатПеремещениеТСиОборудованияТС
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	РегистрСведений.уатМестонахождениеТС.СрезПоследних(&Дата) КАК уатМестонахождениеТС
	|	ПО уатПеремещениеТСиОборудованияТС.ТС = уатМестонахождениеТС.ТС
	|ГДЕ
	|	уатПеремещениеТСиОборудованияТС.Ссылка = &Ссылка
	|	И уатМестонахождениеТС.Колонна <> &Колонна";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("Дата", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени);
	Запрос.УстановитьПараметр("Колонна", ДокументСсылка.Колонна);
	мсвТС = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ТС");
	
	//запрос по остаткам ГСМ
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	уатОстаткиГСМнаТСОстатки.Колонна,
	|	уатОстаткиГСМнаТСОстатки.ТС,
	|	уатОстаткиГСМнаТСОстатки.ГСМ,
	|	уатОстаткиГСМнаТСОстатки.Партия,
	|	уатОстаткиГСМнаТСОстатки.КоличествоОстаток КАК Количество,
	|	уатОстаткиГСМнаТСОстатки.СтоимостьОстаток КАК Стоимость,
	|	уатОстаткиГСМнаТСОстатки.СтоимостьУпрОстаток КАК СтоимостьУпр
	|ИЗ
	|	РегистрНакопления.уатОстаткиГСМнаТС.Остатки(&МоментВремени, ТС В (&мсвТС) И Колонна <> &Колонна) КАК уатОстаткиГСМнаТСОстатки";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.Параметры.Вставить("МоментВремени", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени);
	Запрос.Параметры.Вставить("мсвТС", мсвТС);
	Запрос.Параметры.Вставить("Колонна", ДокументСсылка.Колонна);
	
	тблОстаткиГСМ = Запрос.Выполнить().Выгрузить();
	тблОстаткиГСМ.Колонки.Добавить("Регистратор");
	тблОстаткиГСМ.Колонки.Добавить("Период");
	тблОстаткиГСМ.Колонки.Добавить("ВидДвижения");
	тблОстаткиГСМ.ЗаполнитьЗначения(ДокументСсылка, "Регистратор");
	тблОстаткиГСМ.ЗаполнитьЗначения(ДокументСсылка.Дата, "Период");
	тблОстаткиГСМ.ЗаполнитьЗначения(ВидДвиженияНакопления.Расход, "ВидДвижения");
	
	тблОстаткиГСМ_Приход = тблОстаткиГСМ.Скопировать();
	
	Для Каждого ТекСтрокаТС Из тблОстаткиГСМ_Приход Цикл
		НоваяСтрока = тблОстаткиГСМ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаТС);
		НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
		НоваяСтрока.Колонна = ДокументСсылка.Колонна;
	КонецЦикла;
	
	//управляемая блокировка
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.уатОстаткиГСМнаТС");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = тблОстаткиГСМ;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ТС", "ТС");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ГСМ", "ГСМ");
	Блокировка.Заблокировать();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаГСМ", тблОстаткиГСМ);
КонецПроцедуры // СформироватьТаблицуАгрегатыТС()

// Выполняет контроль возникновения отрицательных остатков.
//
Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	//Зарезервировано
КонецПроцедуры

Процедура СформироватьТаблицаСостояниеТС(ДокументСсылка, СтруктураДополнительныеСвойства)
	
	тблДвижений = Новый ТаблицаЗначений;
	тблДвижений.Колонки.Добавить("Регистратор");
	тблДвижений.Колонки.Добавить("Период");
	тблДвижений.Колонки.Добавить("ДатаОкончания");
	тблДвижений.Колонки.Добавить("ТС");
	тблДвижений.Колонки.Добавить("Состояние");
	тблДвижений.Колонки.Добавить("Контрагент");
	
	Если ЗначениеЗаполнено(ДокументСсылка.Состояние) тогда  	
		Для Каждого ТекСтрокаТС Из ДокументСсылка.ТС Цикл
			НоваяСтрока = тблДвижений.Добавить();
			НоваяСтрока.ТС = ТекСтрокаТС.ТС;
			НоваяСтрока.Период = ТекСтрокаТС.ДатаВвода;
			НоваяСтрока.Регистратор = ДокументСсылка;
			НоваяСтрока.Состояние = ДокументСсылка.Состояние;
		КонецЦикла;
	КонецЕСЛИ;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСостоянийТС", тблДвижений);
КонецПроцедуры // СформироватьТаблицаСостояниеТС()
